"""
Задания для решения в классе.

Пишите код прямо под описанием заданий.
"""
'''
Задание 0. Напишите программу для счета мелких денег. Она должна спрашивать:
    «Сколько у вас монет по 50 копеек?»;
    «Сколько у вас монет по 10 копеек?»;
    «Сколько у вас монет по 5 копеек?»;
    «Сколько у вас монет по 1 копейке?».
После этого на экране должна появиться общая сумма (сумма денег, а не номиналов).
'''


' Задание 1. Даны два целых числа (вводятся пользователем.) Выведите значение наименьшего из них. '


''' Задание 2. В математике функция sign(x) (знак числа) определена так: 
sign(x) = 1, если x > 0, 
sign(x) = -1, если x < 0, 
sign(x) = 0, если x = 0.
Для числа x (вводится пользователем) выведите значение sign(x). 
Эту задачу желательно решить с использованием каскадных инструкций if... elif... else. 
'''


''' Задание 3.
В магазине распродажа. Натоварыза 10 долларов и меньше скидка 10%,
а на товары дороже 10 долларов — 20 %. Напишите программу, которая 
будет запрашивать цену товара и показывать размер скидки (10 или 20 %) и итоговую цену.
'''


'''Задание 4.
Путешествуя на автомобиле, вы заехали на заправку. До следующей заправки 200 километров. 
Напишите программу, которая будет определять, нужно ли вам заправляться или же можно 
подождать до следующей станции.

Программа должна спрашивать:
 Каков размер вашего бензобака в литрах?
 Сколько горючего в бензобаке (в процентах)?
 Сколько километров проходит автомобиль НА ОДНОМ ЛИТРЕ бензина? 

Результат работы программы должен выглядеть примерно так:
   input - Размер бензобака: 60
   input - Заполненность в процентах: 40
   input - Км на литр: 10
   print - Вы можете проехать еще 240 км.
   print - Следующая заправка через 200 км.
   print - Можно подождать следующей заправки.
'''


''' Задание 5.
Напишите программу, выводящую на экран таблицу умножения.
Первым делом она должна спрашивать, для какого числа требуется вывести таблицу.
'''


''' Задание 6.
Добавьте к предыдущей программе дополнительные детали, 
уточнив, до какого множителя следует выводить таблицу умножения.
'''


''' Задание 7.
Дано натуральное число. Требуется определить, является ли год с данным номером високосным. 
Если год является високосным, то выведите YES, иначе выведите NO. 
Напомню, что в соответствии с григорианским календарем, год является високосным, 
если его номер кратен 4, но не кратен 100, а также если он кратен 400.
'''


''' Задание 8.
Даны три целых числа. Определите, сколько среди них совпадающих. 
Программа должна вывести одно из чисел: 3 (если все совпадают), 
2 (если два совпадает) или 0 (если все числа различны).
'''


''' Задание 9.
Даны два целых числа A и B (вводятся пользователем) (при этом A ≤ B). 
Выведите все числа от A до B включительно.
'''


''' Задание 10.
Даны два целых числа A и В. Выведите все числа от A до B включительно, 
в порядке возрастания, если A < B, или в порядке убывания в противном случае.
'''


''' Задание 11.
Факториалом числа n называется произведение 1 × 2 × ... × n. Обозначение: n!.
По данному натуральному n (вводится пользователем) вычислите значение n!. 
'''

''' Задание 12.
Выведите лесенку из символов звездочки - *. 
Количество ступеней вводится пользователем.
'''
